In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@email.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
# if u want to look at the columns 
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# to change the name of few columns
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
# update the columns labels
# upper case all columns labels
# use the list Comprehension
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
# update the columns labels
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
df.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [11]:
# update the columns labels
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [12]:
# update the columns labels
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':'last', 'EMAIL':'email'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [13]:
# to look at the values of row 2
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [14]:
# to update the values of row 2
df.loc[2] = ['John','Smith','JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [15]:
# to update some data in row 2
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [16]:
# to filter on specific value
filt = (df['email']=='JohnDoe@email.com')
filt

0    False
1    False
2     True
Name: email, dtype: bool

In [17]:
df[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [18]:
# df[filt]['email']='Smith' # this will crash, Error
# you must use .loc
# to update specific data by using .loc
df.loc[filt, ['last', 'email']]=['Smith', 'JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [19]:
# update the format of specific column values (Series Values)
df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [20]:
# to get the length of each value in specific column (Series) by using .apply() function
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

In [21]:
# upper case the values of email column (email Series)
df['email'] = df['email'].str.upper()
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@EMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith      JOHNSMITH@EMAIL.COM

In [22]:
# lower case the values of email column (email Series)
df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [23]:
# define a function to upper case the values of email column (email Series)
def update_email(email):
    return email.upper()

In [24]:
# apply the function update_email to upper case the values of email column (email Series)
df['email'] = df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@EMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith      JOHNSMITH@EMAIL.COM

In [25]:
# define a function to lower case the values of email column (email Series)
def update_email(email):
    return email.lower()

In [26]:
# apply the function update_email to lower case the values of email column (email Series)
df['email'] = df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [27]:
# using anonymous lambda function to upper the values of email column (email Series)
# lambda working only on a Series object
# lambda arguments : expression
# A lambda function can take any number of arguments, but can only have one expression
df['email'] = df['email'].apply(lambda x: x.upper())
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@EMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith      JOHNSMITH@EMAIL.COM

In [28]:
# using anonymous lambda function to lower the values of email column (email Series)
# lambda working only on a Series object
# lambda arguments : expression
# A lambda function can take any number of arguments, but can only have one expression
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [29]:
# to get the length of each value in email series
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

In [30]:
# to get the # of values in each column (series) for every coulmn or every series
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [31]:
# to get the # of values in specific column (series) for example: email series
len(df['email'])

3

In [32]:
# to get the # of values (columns) in each row for every row
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [33]:
# to get the min. length value in each Series
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@email.com
dtype: object

In [34]:
# using anonymous lambda function to get the min. length value in each Series
# lambda working only on a Series object
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@email.com
dtype: object

In [35]:
# to get the length of every element in the DataFrame df
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     19

In [36]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [37]:
# to upper case every element in the DataFrame df
df.applymap(str.upper)

   first     last                    email
0  COREY  SCHAFER  COREYMSCHAFER@EMAIL.COM
1   JANE      DOE        JANEDOE@EMAIL.COM
2   JOHN    SMITH      JOHNSMITH@EMAIL.COM

In [38]:
# to lower case every element in the DataFrame df
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@email.com
1   jane      doe        janedoe@email.com
2   john    smith      johnsmith@email.com

In [39]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@email.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [40]:
# change (replace) the value in specific column (Series)
# change (replace) the value in first Series
#df['first'] = df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})
# if we use the .map() method the John will be replaced by value NaN
# so instead we will use .the replace() method
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
df

   first     last                    email
0  Chris  Schafer  coreymschafer@email.com
1   Mary      Doe        janedoe@email.com
2   John    Smith      johnsmith@email.com

In [41]:
# change (replace) the value in specific column (Series)
# change (replace) the value in email Series
df['email'] = df['email'].replace({'coreymschafer@email.com': 'chrismschafer@email.com', 
                                   'janedoe@email.com': 'marydoe@email.com'})
df

   first     last                    email
0  Chris  Schafer  chrismschafer@email.com
1   Mary      Doe        marydoe@email.com
2   John    Smith      johnsmith@email.com